<a href="https://colab.research.google.com/github/YeonKang/Python-for-Machine-Learning/blob/main/Lec2_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**import pandas**

In [1]:
import pandas as pd

**get data**

In [3]:
data_url ='https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data' #Data URL
#data_url = './housing.data'
df_data = pd.read_csv(data_url,sep='\s+',header=None) #load csv type data  #sep = criteria for dividing data, \s -> empty space

In [4]:
df_data.head() #print the first five lines

        0     1     2   3      4      5   ...  8      9     10      11    12    13
0  0.00632  18.0  2.31   0  0.538  6.575  ...   1  296.0  15.3  396.90  4.98  24.0
1  0.02731   0.0  7.07   0  0.469  6.421  ...   2  242.0  17.8  396.90  9.14  21.6
2  0.02729   0.0  7.07   0  0.469  7.185  ...   2  242.0  17.8  392.83  4.03  34.7
3  0.03237   0.0  2.18   0  0.458  6.998  ...   3  222.0  18.7  394.63  2.94  33.4
4  0.06905   0.0  2.18   0  0.458  7.147  ...   3  222.0  18.7  396.90  5.33  36.2

[5 rows x 14 columns]

In [5]:
df_data.columns = ['CRIM','ZN','INDUS','CHAS','NOX','RM','AGE','DIS','RAD','TAX','PTRATIO','B','LSTAT','MEDV'] #name the Column Header
df_data.head()

      CRIM    ZN  INDUS  CHAS    NOX  ...    TAX  PTRATIO       B  LSTAT  MEDV
0  0.00632  18.0   2.31     0  0.538  ...  296.0     15.3  396.90   4.98  24.0
1  0.02731   0.0   7.07     0  0.469  ...  242.0     17.8  396.90   9.14  21.6
2  0.02729   0.0   7.07     0  0.469  ...  242.0     17.8  392.83   4.03  34.7
3  0.03237   0.0   2.18     0  0.458  ...  222.0     18.7  394.63   2.94  33.4
4  0.06905   0.0   2.18     0  0.458  ...  222.0     18.7  396.90   5.33  36.2

[5 rows x 14 columns]

In [6]:
df_data.values

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

**Pandas Series**

In [4]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [8]:
list_data = [1,2,3,4,5]
example_obj = Series(data = list_data)
example_obj
#result -> index, data
#           data type

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
list_data = [1,2,3,4,5]
list_name = ["a","b","c","d","e"]
example_obj = Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data")

In [7]:
example_obj["a"]

1.0

In [8]:
example_obj["a"] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [9]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a","b","c","d","e","f","g","h"]
series_obj_1 = Series(dict_data_1, index=indexes)
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

**Dataframe overview**

In [11]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [12]:
raw_data = {'first_name': ['Jason','Mplly','Tina','Jake','Amy'],'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],'age' : [42,52,36,24,73],'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [13]:
DataFrame(raw_data,columns=["age","city"])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [14]:
DataFrame(raw_data,columns=["first_name","last_name","age","city","debt"])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Mplly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [36]:
df = DataFrame(raw_data,columns=["first_name","last_name","age","city","debt"])
df.first_name

0    Jason
1    Mplly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [17]:
df["first_name"]

0    Jason
1    Mplly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [27]:
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Mplly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [28]:
df.T #Transpose

                        0          1      2        3       4
first_name          Jason      Mplly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [29]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Mplly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [30]:
df.to_csv()

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Mplly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [37]:
del df["debt"]
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [19]:
df.loc[1] #loc[] : index location

first_name        Mplly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [20]:
df["age"].iloc[1:] #iloc[] : index position

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [24]:
s = pd.Series(np.nan,index=[49,48,47,46,45,1,2,3,4,5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [26]:
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [23]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

**Data Selection**

In [41]:
import pandas as pd
import numpy as np
raw_data = {'first_name': ['Jason','Mplly','Tina','Jake','Amy'],'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],'age' : [42,52,36,24,73],'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [42]:
df["first_name"].head(3)

0    Jason
1    Mplly
2     Tina
Name: first_name, dtype: object

In [46]:
df[["first_name","last_name","city"]].head(3)

  first_name last_name           city
0      Jason    Miller  San Francisco
1      Mplly  Jacobson      Baltimore
2       Tina       Ali          Miami

In [47]:
df[:3]

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami

In [49]:
df["city"][:3]

0    San Francisco
1        Baltimore
2            Miami
Name: city, dtype: object

In [52]:
age_series = df["age"]
age_series[:3]

0    42
1    52
2    36
Name: age, dtype: int64

In [53]:
age_series[[0,1,2]]

0    42
1    52
2    36
Name: age, dtype: int64

In [54]:
age_series[age_series>40] #boolean index

0    42
1    52
4    73
Name: age, dtype: int64

In [55]:
df[["first_name","last_name"]][:2] #column & index number

  first_name last_name
0      Jason    Miller
1      Mplly  Jacobson

In [56]:
df.loc[[0,1],["first_name","last_name"]] #index name & column

  first_name last_name
0      Jason    Miller
1      Mplly  Jacobson

In [59]:
df.iloc[:2,:2] #index number & column number

  first_name last_name
0      Jason    Miller
1      Mplly  Jacobson

**index reset**

In [63]:
df.index = list(range(5,10))
df.head()

  first_name last_name  age           city
5      Jason    Miller   42  San Francisco
6      Mplly  Jacobson   52      Baltimore
7       Tina       Ali   36          Miami
8       Jake    Milner   24        Douglas
9        Amy     Cooze   73         Boston

**Data drop**

In [65]:
import pandas as pd
import numpy as np
raw_data = {'first_name': ['Jason','Mplly','Tina','Jake','Amy'],'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],'age' : [42,52,36,24,73],'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [66]:
df.drop(1)

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston